[
    {
        "article": 1,
        "author": "Idriss Dimson",
        "img_src":"media/homework-1.png",
        "title":"Homework #1",
        "body":"In this homework, I had to downloaded Git and learn to push with it. This homework was significant because I never used Git before and learning how to push repositories with it helped me become a better web developer and added another skill I could use in the real world."
    },
    {
        "article": 2,
        "author": "Idriss Dimson",
        "img_src":"media/homework-2.png",
        "title":"Homework #2",
        "body":"In this homework, I used what I knew already about web development and applied it to writing HTML/CSS code to recreate an example CV from Wix.com. What I learned from this week is how to use an HTML/CSS validator. Use of a validator made me realize that I can write my code cleaner than I expected. In addition to this, I learned about specificity. I learned that certain CSS references have different specificities than others."
    },{
        "article": 3,
        "author": "Idriss Dimson",
        "img_src":"media/homework-3.png",
        "title":"Homework #3",
        "body":"In this homework, I finally understood what Flexbox and Grid were and when/how to use the two. I used my newfound knowledge to create a replica of the New York Times website. Doing so proved to be difficult because I had to learn how to structure the website for use with grid, as well as learning how to make grid work hand-in-hand with flex box. However, once I understood how to use it, I could add knowing how to use flex box/grid to the things I learned how to do."
    },{
        "article": 4,
        "author": "Idriss Dimson",
        "img_src":"media/homework-4.png",
        "title":"Homework #4",
        "body":"In this homework, I learned how to use media query commands to make my website compatible for smaller screens. This was valuable because before, I didn’t have a way to make my website designed for both mobile and desktop, so I designed two different websites. Also, I learned how make my website printable. Finally, I learned how to make a wireframe using a wireframe tool. I always live-coded wireframes, so I figured I could use this opportunity to expand my experience and use a new tool, Adobe XD."
    },{
        "article": 5,
        "author": "Idriss Dimson",
        "img_src":"media/homework-5.png",
        "title":"Homework #5",
        "body":"In this homework, I learned how to use SCSS. This was always a goal of mine and I’m glad I was able to accomplish it. In addition to this, I learned how to combine everything I learned so far into one assignment, which I thought was cool. I also used BEM for the first time. I don’t personally prefer it, but it’s a great way to structure my CSS code."
    },{
        "article": 7,
        "author": "Idriss Dimson",
        "img_src":"media/homework-7.png",
        "title":"Homework #7",
        "body":"In this homework, I used JavaScript to create a Tic Tac Toe game. This was interesting experience because it forced me to be creative with JavaScript classes and elements. It was very educational and gave me new tools to use in JavaScript."
    },{
        "article": 8,
        "author": "Idriss Dimson",
        "img_src":"media/homework-8.png",
        "title":"Homework #8",
        "body":"In this homework, I created a CSS Animation from scratch. It was interesting to use keyframes to make an animation for my project. It was particularly difficult to make it seem like the ball “bounced”, but I solved that by make the ball slightly smaller before it goes back up."
    },{
        "article": 9,
        "author": "Idriss Dimson",
        "img_src":"media/homework-9.png",
        "title":"Homework #9",
        "body":"In this homework, I learned how to set up a local server. I was surprised by how simple it was to do. I thought it was significantly harder to do. In addition, I learned how to use an API and read data/ write data from the json files. That too surprised me by how simple it was. I thought it would be more difficult, however, I gained a new skill from it."
    },{
        "article": 10,
        "author": "Idriss Dimson",
        "img_src":"media/homework-10.png",
        "title":"Homework #10",
        "body":"In this homework, I learned how to push to both a Heroku app and a GitHub app. Even better, I learned how to connect GitHub to Heroku, so Heroku push conflicts wouldn’t happen. In addition, I learned how to use Rails to add another skill to my skillset."
    },{
        "article": 11,
        "author": "Idriss Dimson",
        "img_src":"media/homework-11.png",
        "title":"Homework #11",
        "body":"In the final homework, I learned about product management and how to use Google Analytics. I never realized how important analytics was and how it determines how well an application does. It was interesting to read the two articles talk about how important retention is to an app success. It’s something I won’t forget when I pursue making a new application."
    }
]